; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=10, locations=12, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=21, seed=62

(define (problem transport-21)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l11)
    (at p2 l6)
    (at p3 l3)
    (at p4 l9)
    (at p5 l3)
    (at p6 l3)
    (at p7 l1)
    (at p8 l5)
    (at p9 l11)
    (at p10 l3)
    (at v1 l2)
    (at v2 l1)
    (at v3 l8)
    (at v4 l8)
    (at v5 l9)
    )
 (:goal  (and 
    (at p1 l1)
    (at p2 l10)
    (at p3 l11)
    (at p4 l3)
    (at p5 l12)
    (at p6 l4)
    (at p7 l12)
    (at p8 l2)
    (at p9 l6)
    (at p10 l9))))

; plan
1. (pick-up v5 l9 p4 c1 c2)
   deleted: (at p4 l9) (capacity v5 c2)
   added: (in p4 v5) (capacity v5 c1)
   goals met: 0 of 10
2. (pick-up v2 l1 p7 c0 c1)
   deleted: (at p7 l1) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 0 of 10
3. (drive v2 l1 l12)
   deleted: (at v2 l1)
   added: (at v2 l12)
   goals met: 0 of 10
4. (drop v2 l12 p7 c0 c1)
   deleted: (in p7 v2) (capacity v2 c0)
   added: (at p7 l12) (capacity v2 c1)
   goals met: 1 of 10
5. (drive v5 l9 l3)
   deleted: (at v5 l9)
   added: (at v5 l3)
   goals met: 1 of 10
6. (pick-up v5 l3 p10 c0 c1)
   deleted: (at p10 l3) (capacity v5 c1)
   added: (in p10 v5) (capacity v5 c0)
   goals met: 1 of 10
7. (drop v5 l3 p4 c0 c1)
   deleted: (in p4 v5) (capacity v5 c0)
   added: (at p4 l3) (capacity v5 c1)
   goals met: 2 of 10
8. (drive v5 l3 l9)
   deleted: (at v5 l3)
   added: (at v5 l9)
   goals met: 2 of 10
9. (drop v5 l9 p10 c1 c2)
   deleted: (in p10 v5) (capacity v5 c1)
   added: (at p10 l9) (capacity v5 c2)
   goals met: 3 of 10
10. (drive v2 l12 l3)
   deleted: (at v2 l12)
   added: (at v2 l3)
   goals met: 3 of 10
11. (pick-up v2 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 3 of 10
12. (drive v2 l3 l12)
   deleted: (at v2 l3)
   added: (at v2 l12)
   goals met: 3 of 10
13. (drop v2 l12 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l12) (capacity v2 c1)
   goals met: 4 of 10
14. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 4 of 10
15. (pick-up v1 l5 p8 c0 c1)
   deleted: (at p8 l5) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 4 of 10
16. (drive v2 l12 l1)
   deleted: (at v2 l12)
   added: (at v2 l1)
   goals met: 4 of 10
17. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 4 of 10
18. (drop v1 l2 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l2) (capacity v1 c1)
   goals met: 5 of 10
19. (drive v1 l2 l10)
   deleted: (at v1 l2)
   added: (at v1 l10)
   goals met: 5 of 10
20. (drive v2 l1 l11)
   deleted: (at v2 l1)
   added: (at v2 l11)
   goals met: 5 of 10
21. (pick-up v2 l11 p1 c0 c1)
   deleted: (at p1 l11) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 5 of 10
22. (drive v2 l11 l1)
   deleted: (at v2 l11)
   added: (at v2 l1)
   goals met: 5 of 10
23. (drop v2 l1 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l1) (capacity v2 c1)
   goals met: 6 of 10
24. (drive v1 l10 l6)
   deleted: (at v1 l10)
   added: (at v1 l6)
   goals met: 6 of 10
25. (pick-up v1 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 6 of 10
26. (drive v2 l1 l11)
   deleted: (at v2 l1)
   added: (at v2 l11)
   goals met: 6 of 10
27. (drive v1 l6 l10)
   deleted: (at v1 l6)
   added: (at v1 l10)
   goals met: 6 of 10
28. (drop v1 l10 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l10) (capacity v1 c1)
   goals met: 7 of 10
29. (pick-up v2 l11 p9 c0 c1)
   deleted: (at p9 l11) (capacity v2 c1)
   added: (in p9 v2) (capacity v2 c0)
   goals met: 7 of 10
30. (drive v2 l11 l6)
   deleted: (at v2 l11)
   added: (at v2 l6)
   goals met: 7 of 10
31. (drop v2 l6 p9 c0 c1)
   deleted: (in p9 v2) (capacity v2 c0)
   added: (at p9 l6) (capacity v2 c1)
   goals met: 8 of 10
32. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 8 of 10
33. (drive v1 l11 l3)
   deleted: (at v1 l11)
   added: (at v1 l3)
   goals met: 8 of 10
34. (pick-up v1 l3 p3 c0 c1)
   deleted: (at p3 l3) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 8 of 10
35. (drive v1 l3 l11)
   deleted: (at v1 l3)
   added: (at v1 l11)
   goals met: 8 of 10
36. (drive v2 l6 l3)
   deleted: (at v2 l6)
   added: (at v2 l3)
   goals met: 8 of 10
37. (pick-up v2 l3 p6 c0 c1)
   deleted: (at p6 l3) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 8 of 10
38. (drive v2 l3 l4)
   deleted: (at v2 l3)
   added: (at v2 l4)
   goals met: 8 of 10
39. (drop v2 l4 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l4) (capacity v2 c1)
   goals met: 9 of 10
40. (drop v1 l11 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l11) (capacity v1 c1)
   goals met: 10 of 10
